# Titanic Case Study

# Variable Notes

- pclass: A proxy for socio-economic status (SES)
 - 1st = Upper
 - 2nd = Middle
 - 3rd = Lower

- age: Age is fractional if less than 1. If the age is estimated, is it in the form of xx.5

- sibsp: The dataset defines family relations in this way...

- Sibling = brother, sister, stepbrother, stepsister
- Spouse = husband, wife (mistresses and fiancÃ©s were ignored)
- parch: The dataset defines family relations in this way...
- Parent = mother, father
- Child = daughter, son, stepdaughter, stepson
  Some children travelled only with a nanny, therefore parch=0 for them.

# Perform followings on dataset:
- Read the dataset and display top/bottom rows
- Get a summary of whole dataset
- Analyse the data and find out the columns which will not be part of further data analysis and provide the reason why?
- Drop those columns which needs to be dropped
- Find out the data type of each column
- Find out the number of entries in each column
- Find out which columns is having more number of missing values
- Replace missing values in each column and provide the reason for choosing one function to replace missing values
- Fix the issue with fare column usign regex flag then type casting of the whole column 
- Find out total number of Male/Female passengers
- Find out total number of passengers in each passenger class
- Find out total number of Survived/Not-survived passengers
- Find out total number of passengers of various age groups (0-30, 31-60 and >60)
- Find out which age group survived
- Find out total number of passengers city ((C = Cherbourg; Q = Queenstown; S = Southampton)) Vs PassengerClass

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

### Read the dataset and display top/bottom rows

In [2]:
df = pd.read_csv("titanic_dataset_modified.csv")

In [3]:
df.head()

,Unnamed: 0,pclass,survived,name,gender,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,$211.34,B5,S,2,NaN,"St Louis, MO"
1,1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,$151.55,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,$151.55,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,$151.55,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,$151.55,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [4]:
df.head(2)

,Unnamed: 0,pclass,survived,name,gender,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,$211.34,B5,S,2,NaN,"St Louis, MO"
1,1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,$151.55,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"

In [5]:
df.tail(2)

,Unnamed: 0,pclass,survived,name,gender,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
1307,1307,3,0,"Zakarian, Mr. Ortin",male,27.0,0,0,2670,$7.23,NaN,C,NaN,NaN,NaN
1308,1308,3,0,"Zimmerman, Mr. Leo",male,29.0,0,0,315082,$7.88,NaN,S,NaN,NaN,NaN

### Get a summary of whole dataset

In [6]:
df.describe()

,Unnamed: 0,pclass,survived,age,sibsp,parch,body
count,1309.000000,1309.000000,1309.000000,1046.000000,1309.000000,1309.000000,121.000000
mean,654.000000,2.294882,0.381971,29.881135,0.498854,0.385027,160.809917
std,378.020061,0.837836,0.486055,14.413500,1.041658,0.865560,97.696922
min,0.000000,1.000000,0.000000,0.166700,0.000000,0.000000,1.000000
25%,327.000000,2.000000,0.000000,21.000000,0.000000,0.000000,72.000000
50%,654.000000,3.000000,0.000000,28.000000,0.000000,0.000000,155.000000
75%,981.000000,3.000000,1.000000,39.000000,1.000000,0.000000,256.000000
max,1308.000000,3.000000,1.000000,80.000000,8.000000,9.000000,328.000000

###### How to display all the columns

In [7]:
df.describe(include="all")

,Unnamed: 0,pclass,survived,name,gender,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
count,1309.000000,1309.000000,1309.000000,1309,1309,1046.000000,1309.000000,1309.000000,1309,1308,295,1307,486,121.000000,745
unique,NaN,NaN,NaN,1307,2,NaN,NaN,NaN,929,263,186,3,27,NaN,369
top,NaN,NaN,NaN,"Connolly, Miss. Kate",male,NaN,NaN,NaN,CA. 2343,$8.05,C23 C25 C27,S,13,NaN,"New York, NY"
freq,NaN,NaN,NaN,2,843,NaN,NaN,NaN,11,60,6,914,39,NaN,64
mean,654.000000,2.294882,0.381971,NaN,NaN,29.881135,0.498854,0.385027,NaN,NaN,NaN,NaN,NaN,160.809917,NaN
std,378.020061,0.837836,0.486055,NaN,NaN,14.413500,1.041658,0.865560,NaN,NaN,NaN,NaN,NaN,97.696922,NaN
min,0.000000,1.000000,0.000000,NaN,NaN,0.166700,0.000000,0.000000,NaN,NaN,NaN,NaN,NaN,1.000000,NaN
25%,327.000000,2.000000,0.000000,NaN,NaN,21.000000,0.000000,0.000000,NaN,NaN,NaN,NaN,NaN,72.000000,NaN
50%,654.000000,3.000000,0.000000,NaN,NaN,28.000000,0.000000,0.000000,NaN,NaN,NaN,NaN,NaN,155.000000,NaN
75%,981.000000,3.000000,1.000000,NaN,NaN,39.000000,1.000000,0.000000,NaN,NaN,NaN,NaN,NaN,256.000000,NaN
max,1308.000000,3.000000,1.000000,NaN,NaN,80.000000,8.000000,9.000000,NaN,NaN,NaN,NaN,NaN,328.000000,NaN

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 15 columns):
Unnamed: 0    1309 non-null int64
pclass        1309 non-null int64
survived      1309 non-null int64
name          1309 non-null object
gender        1309 non-null object
age           1046 non-null float64
sibsp         1309 non-null int64
parch         1309 non-null int64
ticket        1309 non-null object
fare          1308 non-null object
cabin         295 non-null object
embarked      1307 non-null object
boat          486 non-null object
body          121 non-null float64
home.dest     745 non-null object
dtypes: float64(2), int64(5), object(8)
memory usage: 153.5+ KB

### Analyse the data and find out the columns which will not be part of further data analysis and provide the reason why?

In [9]:
df.head(2)

,Unnamed: 0,pclass,survived,name,gender,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,$211.34,B5,S,2,NaN,"St Louis, MO"
1,1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,$151.55,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"

### Drop those columns which needs to be dropped

In [10]:
df.drop(["Unnamed: 0","name","ticket","cabin","boat","body","home.dest"],axis=1,inplace=True)

In [11]:
df.head(2)

   pclass  survived  gender      age  sibsp  parch     fare embarked
0       1         1  female  29.0000      0      0  $211.34        S
1       1         1    male   0.9167      1      2  $151.55        S

### Find out the data type of each column

In [12]:
df.dtypes

pclass        int64
survived      int64
gender       object
age         float64
sibsp         int64
parch         int64
fare         object
embarked     object
dtype: object

### Find out the number of entries in each column

In [13]:
df.columns

Index(['pclass', 'survived', 'gender', 'age', 'sibsp', 'parch', 'fare',
       'embarked'],
      dtype='object')

In [14]:
df.keys()

Index(['pclass', 'survived', 'gender', 'age', 'sibsp', 'parch', 'fare',
       'embarked'],
      dtype='object')

In [15]:
# Using size and count
# Size : will return total nu,ber of observations including missing values
# Count: Will return only non-zero values

In [16]:
for k in df.keys():
    #print(k)
    print("Total number of entries in ",k,"::",df[k].size)

Total number of entries in  pclass :: 1309
Total number of entries in  survived :: 1309
Total number of entries in  gender :: 1309
Total number of entries in  age :: 1309
Total number of entries in  sibsp :: 1309
Total number of entries in  parch :: 1309
Total number of entries in  fare :: 1309
Total number of entries in  embarked :: 1309

In [17]:
for k in df.keys():
    #print(k)
    print("Total number of entries in ",k,"::",df[k].count())

Total number of entries in  pclass :: 1309
Total number of entries in  survived :: 1309
Total number of entries in  gender :: 1309
Total number of entries in  age :: 1046
Total number of entries in  sibsp :: 1309
Total number of entries in  parch :: 1309
Total number of entries in  fare :: 1308
Total number of entries in  embarked :: 1307

### Find out which columns is having more number of missing values

In [18]:
for k in df.keys():
    #print(k)
    print("Total number of missing values in ",k,"::",df[k].size-df[k].count())

Total number of missing values in  pclass :: 0
Total number of missing values in  survived :: 0
Total number of missing values in  gender :: 0
Total number of missing values in  age :: 263
Total number of missing values in  sibsp :: 0
Total number of missing values in  parch :: 0
Total number of missing values in  fare :: 1
Total number of missing values in  embarked :: 2

##### in %

In [19]:
for k in df.keys():
    #print(k)
    print("Total number of missing values in ",k,"::",((df[k].size-df[k].count())/df[k].size)*100)

Total number of missing values in  pclass :: 0.0
Total number of missing values in  survived :: 0.0
Total number of missing values in  gender :: 0.0
Total number of missing values in  age :: 20.091673032849503
Total number of missing values in  sibsp :: 0.0
Total number of missing values in  parch :: 0.0
Total number of missing values in  fare :: 0.07639419404125286
Total number of missing values in  embarked :: 0.15278838808250572

In [20]:
for k in df.keys():
    #print(k)
    print("Total number of missing values in ",k,"::",round(((df[k].size-df[k].count())/df[k].size)*100),2)

Total number of missing values in  pclass :: 0.0 2
Total number of missing values in  survived :: 0.0 2
Total number of missing values in  gender :: 0.0 2
Total number of missing values in  age :: 20.0 2
Total number of missing values in  sibsp :: 0.0 2
Total number of missing values in  parch :: 0.0 2
Total number of missing values in  fare :: 0.0 2
Total number of missing values in  embarked :: 0.0 2

###### Finding missing values using isnull()

In [21]:
df.age.isnull().any()

True

In [22]:
df.age.isnull().sum()

263

### How to get unique values of any features

In [23]:
df.pclass.unique()

array([1, 2, 3], dtype=int64)

In [24]:
df.embarked.unique()

array(['S', 'C', nan, 'Q'], dtype=object)

### How to find out counts of each category

In [25]:
df.pclass.value_counts()

3    709
1    323
2    277
Name: pclass, dtype: int64

In [26]:
df.embarked.value_counts()

S    914
C    270
Q    123
Name: embarked, dtype: int64

### Replace missing values in each column and provide the reason for choosing one function to replace missing values

###### for age column

In [27]:
df.age

0       29.0000
1        0.9167
2        2.0000
3       30.0000
4       25.0000
         ...
1304    14.5000
1305        NaN
1306    26.5000
1307    27.0000
1308    29.0000
Name: age, Length: 1309, dtype: float64

In [28]:
# df.fillna(<value_to_be_filled>,inplace=True)

In [29]:
df.age.mean()

29.8811345124283

In [30]:
df.age.fillna(df.age.mean(),inplace=True)

In [31]:
df.age.isnull().any()

False

In [32]:
df.age.isnull().sum()

0

### Fix the issue with fare column usign regex flag then type casting of the whole column

### Find out total number of Male/Female passengers

### Find out total number of passengers in each passenger class

### Find out total number of Survived/Not-survived passengers

### Find out total number of passengers of various age groups (0-30, 31-60 and >60)

### Find out which age group survived

### Find out total number of passengers city ((C = Cherbourg; Q = Queenstown; S = Southampton)) Vs PassengerClass